template/base/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object blockMeshDict; 	
}

convertToMeters 1;

vertices
  (
    (0 2 0)
    (0 0 0)
    (0 0 0)
    (0 0 0)
    (0 0 0)
    (0 0 0)
    (0 0 0)
    (0 0 0)
  ); 	

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (0 0 0)
    simpleGrading
    (1 1 1)
  ); 	

edges
  (
  ); 	

boundary
  (
    maxY

    {
      type patch;
      faces
        (

          (
            3
            7
            6
            2
          )
        ); 	

    }
    minX

    {
      type patch;
      faces
        (

          (
            0
            4
            7
            3
          )
        ); 	

    }
    maxX

    {
      type patch;
      faces
        (

          (
            2
            6
            5
            1
          )
        ); 	

    }
    minY

    {
      type patch;
      faces
        (

          (
            1
            5
            4
            0
          )
        ); 	

    }
    minZ

    {
      type patch;
      faces
        (

          (
            0
            3
            2
            1
          )
        ); 	

    }
    maxZ

    {
      type patch;
      faces
        (

          (
            4
            5
            6
            7
          )
        ); 	

    }
  ); 	

mergePatchPairs
  (
  ); 	

