template/base/system/snappyHexMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object autoHexMeshDict; 	
}

castellatedMesh true;

snap true; 	

addLayers false; 	

geometry
{
} 	

castellatedMeshControls
{
  maxLocalCells 100000;
  maxGlobalCells 2000000; 	
  minRefinementCells 10; 	
  nCellsBetweenLevels 2; 	
  features
    (
    ); 	
  refinementSurfaces
  {
  } 	
  resolveFeatureAngle 30; 	
  refinementRegions
  {
  } 	
  locationInMesh (0.01 0.01 0.01); 	
  allowFreeStandingZoneFaces true; 	
} 	

snapControls
{
  nSmoothPatch 3;
  tolerance 1.0; 	
  nSolveIter 60; 	
  nRelaxIter 5; 	
  nFeatureSnapIter 5; 	
  implicitFeatureSnap false; 	
  explicitFeatureSnap true; 	
  multiRegionFeatureSnap false; 	
} 	

addLayersControls
{
  relativeSizes true;
  layers
  {
    maxY
    {
      nSurfaceLayers 3;
    }
  } 	
  expansionRatio 1.3; 	
  finalLayerThickness 1; 	
  minThickness 0.1; 	
  nGrow 0; 	
  featureAngle 30; 	
  nRelaxIter 3; 	
  nSmoothSurfaceNormals 1; 	
  nSmoothNormals 3; 	
  nSmoothThickness 2; 	
  maxFaceThicknessRatio 0.5; 	
  maxThicknessToMedialRatio 1; 	
  minMedianAxisAngle 90; 	
  nBufferCellsNoExtrude 0; 	
  nLayerIter 50; 	
} 	

meshQualityControls
{
  maxNonOrtho 100;
  maxBoundarySkewness 40; 	
  maxInternalSkewness 8; 	
  maxConcave 80; 	
  minVol 0; 	
  minTetQuality 1e-30; 	
  minArea -1; 	
  minTwist 0.02; 	
  minDeterminant 0.001; 	
  minFaceWeight 0.02; 	
  minVolRatio 0.01; 	
  minTriangleTwist -1; 	
  nSmoothScale 4; 	
  errorReduction 0.75; 	
} 	

debug 0; 	

mergeTolerance 1e-06; 	

