template/base/0/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volScalarField; 	
 object p; 	
}

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform 100000.0; 	

boundaryField
{
  ".*"
  {
    type calculated;
  }
} 	// ************************************************************************* //

