template/base/0/IDefault
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volScalarField; 	
 object IDefault; 	
}

dimensions [ 1 0 -3 0 0 0 0 ];

internalField uniform 0; 	

boundaryField
{
  ".*"
  {
    type calculated;
  }
} 	// ************************************************************************* //

