template/base/0/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class volScalarField; 	
 object k; 	
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.1; 	

boundaryField
{
  ".*"
  {
    type calculated;
  }
} 	// ************************************************************************* //

